nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/eiq_examples/mpp/inc/cm33_core0/pin_mux.h
/*
 * Copyright 2024-2026 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/* IOPCTL pin drive strength macros */
#define IOPCTL_PIO_FUNC0                 0x00U  /*!< Selects pin function 0 */
#define IOPCTL_PIO_FUNC1                 0x01U  /*!< Selects pin function 1 */
#define IOPCTL_PIO_FUNC2                 0x02U  /*!< Selects pin function 2 */
#define IOPCTL_PIO_FUNC3                 0x03U  /*!< Selects pin function 3 */
#define IOPCTL_PIO_FUNC4                 0x04U  /*!< Selects pin function 4 */
#define IOPCTL_PIO_FUNC5                 0x05U  /*!< Selects pin function 5 */
#define IOPCTL_PIO_FUNC6                 0x06U  /*!< Selects pin function 6 */
#define IOPCTL_PIO_FUNC7                 0x07U  /*!< Selects pin function 7 */
#define IOPCTL_PIO_PUPD_DI               0x00U  /*!< Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN               0x10U  /*!< Enable pull-up / pull-down function */
#define IOPCTL_PIO_PULLDOWN_EN           0x00U  /*!< Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN             0x20U  /*!< Enable pull-up function */
#define IOPCTL_PIO_INBUF_DI              0x00U  /*!< Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN              0x40U  /*!< Enable input buffer function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL      0x00U  /*!< Normal mode */
#define IOPCTL_PIO_SLEW_RATE_SLOW        0x80U  /*!< Slow mode */
#define IOPCTL_PIO_DRIVE_100OHM          0x000U /*!< Normal drive: 100 Ohm */
#define IOPCTL_PIO_DRIVE_66OHM           0x100U /*!< Normal drive: 66 Ohm */
#define IOPCTL_PIO_DRIVE_50OHM           0x200U /*!< Normal drive: 50 Ohm */
#define IOPCTL_PIO_DRIVE_33OHM           0x300U /*!< Normal drive: 33 Ohm */
#define IOPCTL_PIO_ANAMUX_DI             0x000U /*!< Analog mux is disabled */
#define IOPCTL_PIO_ANAMUX_EN             0x400U /*!< Analog mux is enabled */
#define IOPCTL_PIO_PSEDRAIN_DI           0x000U /*!< Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PSEDRAIN_EN           0x800U /*!< Pseudo Output Drain is enabled */
#define IOPCTL_PIO_INV_DI                0x000U /*!< Input function is not inverted */
#define IOPCTL_PIO_INV_EN                0x1000U /*!< Input function is inverted */

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 * Configures UART (LP_FLEXCOMM0) pins for debug console.
 */
void BOARD_InitPins(void);

/*!
 * @brief Configures MIPI panel pins for FRDM-IMXRT700.
 */
void BOARD_InitMipiPanelPins(void);

/*!
 * @brief Configures FlexIO panel pins (SSD1963 TFT Proto 5").
 */
void BOARD_InitFlexIOPanelPins(void);

/*!
 * @brief Configures LCD-DBI panel pins (SSD1963 driven by LCDIF).
 */
void BOARD_InitLcdDBIPanelPins(void);

/*!
 * @brief Configures FlexIO camera pins (OV7670).
 */
void BOARD_InitCameraPins(void);

/*!
 * @brief Configures PSRAM pins on XSPI2 port4.
 */
void BOARD_InitPsRamPins_Xspi2(void);

/*!
 * @brief Configures PMIC I2C pins.
 */
void BOARD_InitPmicPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */
